#######################################################
#                                                     
#  Innovus Command Logging File                     
#  Created on Sat Mar 15 18:30:42 2025                
#                                                     
#######################################################

#@(#)CDS: Innovus v15.23-s045_1 (64bit) 04/22/2016 12:32 (Linux 2.6.18-194.el5)
#@(#)CDS: NanoRoute 15.23-s045_1 NR160414-1105/15_23-UB (database version 2.30, 317.6.1) {superthreading v1.26}
#@(#)CDS: AAE 15.23-s014 (64bit) 04/22/2016 (Linux 2.6.18-194.el5)
#@(#)CDS: CTE 15.23-s022_1 () Apr 22 2016 09:38:45 ( )
#@(#)CDS: SYNTECH 15.23-s008_1 () Apr 12 2016 21:52:59 ( )
#@(#)CDS: CPE v15.23-s045
#@(#)CDS: IQRC/TQRC 15.1.4-s213 (64bit) Tue Feb  9 17:31:28 PST 2016 (Linux 2.6.18-194.el5)

set_global _enable_mmmc_by_default_flow      $CTE::mmmc_default
suppressMessage ENCEXT-2799
getDrawView
loadWorkspace -name Physical
win
set init_pwr_net VDD
set init_gnd_net VSS
set init_verilog ./netlist/core.out.v
set init_design_netlisttype Verilog
set init_design_settop 1
set init_top_cell core
set init_lef_file {/home/linux/ieng6/ee260bwi25/public/PDKdata/lef/tcbn65gplus_8lmT2.lef ./subckt/sram_w16.lef}
create_library_set -name WC_LIB -timing "$worst_timing_lib ./subckt/sram_w16_WC.lib"
create_library_set -name BC_LIB -timing "$best_timing_lib ./subckt/sram_w16_BC.lib"
create_rc_corner -name Cmax -cap_table $worst_captbl -T 125
create_rc_corner -name Cmin -cap_table $best_captbl -T -40
create_delay_corner -name WC -library_set WC_LIB -rc_corner Cmax
create_delay_corner -name BC -library_set BC_LIB -rc_corner Cmin
create_constraint_mode -name CON -sdc_file [list $sdc]
create_analysis_view -name WC_VIEW -delay_corner WC -constraint_mode CON
create_analysis_view -name BC_VIEW -delay_corner BC -constraint_mode CON
init_design -setup WC_VIEW -hold BC_VIEW
set_interactive_constraint_modes {CON}
setDesignMode -process 65
floorPlan -site core -r 1 0.50 25.0 25.0 25.0 25.0
globalNetConnect VDD -type pgpin -pin VDD -inst * -verbose
globalNetConnect VSS -type pgpin -pin VSS -inst * -verbose
addRing -spacing {top 3 bottom 3 left 3 right 3} -width {top 5 bottom 5 left 5 right 5} -layer {top M1 bottom M1 left M2 right M2} -center 1 -type core_rings -nets {VSS  VDD}
setObjFPlanBox Instance kmem_instance 100 200 300 375
setObjFPlanBox Instance qmem_instance 100 400 300 600
setObjFPlanBox Instance psum_mem_instance 350 50 550 250
addHaloToBlock {3 3 3 3} qmem_instance
addHaloToBlock {3 3 3 3} kmem_instance
addHaloToBlock {3 3 3 3} psum_mem_instance
flipOrRotateObject -rotate R90 -name qmem_instance
flipOrRotateObject -flip MY -name qmem_instance
flipOrRotateObject -rotate R90 -name kmem_instance
flipOrRotateObject -flip MY -name kmem_instance
flipOrRotateObject -flip MY -name psum_mem_instance
flipOrRotateObject -flip MX -name psum_mem_instance
timeDesign -preplace -prefix preplace
setAddStripeMode -break_at block_ring
addStripe -number_of_sets 15 -spacing 2 -layer M5 -width 1 -nets { VSS VDD } -direction horizontal -start 30 -stop 600
addRing -nets {VDD VSS} -type block_rings -around each_block -layer {top M1 bottom M1 left M2 right M2} -width {top 0.25 bottom 0.25 left 0.25 right 0.25} -spacing {top 1.5 bottom 1.5 left 1.5 right 1.5}
globalNetConnect VDD -type pgpin -pin VDD -sinst qmem_instance -verbose -override
globalNetConnect VDD -type pgpin -pin VDD -sinst kmem_instance -verbose -override
globalNetConnect VDD -type pgpin -pin VDD -sinst psum_mem_instance -verbose -override
globalNetConnect VSS -type pgpin -pin VSS -sinst qmem_instance -verbose -override
globalNetConnect VSS -type pgpin -pin VSS -sinst kmem_instance -verbose -override
globalNetConnect VSS -type pgpin -pin VSS -sinst psum_mem_instance -verbose -overrid
sroute
zoomBox 197.677 365.205 268.397 297.559
fit
zoomBox 65.383 468.439 148.733 415.849
zoomBox 91.184 468.170 105.880 439.900
selectInst qmem_instance
zoomBox 99.135 458.899 106.327 448.672
deselectAll
selectObject Pin {qmem_instance/D[38]}
deselectAll
selectObject Pin {qmem_instance/D[37]}
deselectAll
selectObject Pin {qmem_instance/D[36]}
deselectAll
selectObject Pin {qmem_instance/D[35]}
deselectAll
selectObject Pin {qmem_instance/D[34]}
fit
zoomBox 334.287 221.365 414.661 156.868
zoomBox 373.555 214.105 404.385 199.826
deselectAll
selectInst psum_mem_instance
zoomBox 388.161 212.277 393.596 205.887
deselectAll
selectObject Pin {psum_mem_instance/D[106]}
deselectAll
selectObject Pin {psum_mem_instance/D[105]}
deselectAll
selectObject Pin {psum_mem_instance/D[104]}
fit
zoomBox 329.326 84.433 440.459 0.090
zoomBox 370.010 57.668 405.160 34.483
zoomBox 383.161 54.071 391.630 48.110
deselectAll
selectObject Pin {psum_mem_instance/Q[110]}
deselectAll
selectObject Pin {psum_mem_instance/Q[109]}
fit
saveDesign floorplan.enc
setPlaceMode -timingDriven true -reorderScan false -congEffort medium -modulePlan True -placeIOPins false
setOptMode -effort high -powerEffort high -leakageToDynamicRatio 0.5 -fixFanoutLoad true -restruct true -verbose true
place_opt_design
saveDesign placement.enc
set_ccopt_property -update_io_latency false
create_ccopt_clock_tree_spec -file ./constraints/core.ccopt
ccopt_design
set_propagated_clock [all_clocks]
optDesign -postCTS -hold
saveDesign cts.enc
setNanoRouteMode -quiet -drouteAllowMergedWireAtPin false
setNanoRouteMode -quiet -drouteFixAntenna true
setNanoRouteMode -quiet -routeWithTimingDriven true
setNanoRouteMode -quiet -routeWithSiDriven true
setNanoRouteMode -quiet -routeSiEffort medium
setNanoRouteMode -quiet -routeWithSiPostRouteFix false
setNanoRouteMode -quiet -drouteAutoStop true
setNanoRouteMode -quiet -routeSelectedNetOnly false
setNanoRouteMode -quiet -drouteStartIteration default
routeDesign
setExtractRCMode -engine postRoute
extractRC
setAnalysisMode -analysisType onChipVariation -cppr both
optDesign -postRoute -setup -hold
addFiller -cell DCAP2,DCAP4 -merge true
optDesign -postRoute -drv
optDesign -postRoute -inc
saveDesign route.enc
verifyGeometry
verifyGeometry
verifyConnectivity
report_timing -max_paths 5 > ${design}.post_route.timing.rpt
report_power -outfile core.post_route.power.rpt
streamOut core.gds2 -merge ./subckt/sram_w16.gds2
streamOut core.gds2 -merge ./subckt/sram_w16.gds2
verify_drc -report report.txt
zoomBox 152.703 574.611 256.891 479.354
fit
zoomBox 211.246 568.658 279.713 398.981
fit
fit
zoomBox 338.214 213.058 395.512 137.801
zoomBox 408.021 197.606 414.221 190.166
fit
